[
  {
    "slug": "technical-debt",
    "title": "Buried in Technical Debt? Making the Right Investments in Your Code",
    "subtitle": "Technical Debt",
    "conferences": [
      {
        "name": "Atlanta Code Camp 2021",
        "type": "In-person",
        "date": "2021-10-09",
        "link": "https://atlantacodecamp.com/2021"
      },
      {
        "name": "Big Mountain Data & Dev 2021",
        "type": "Virtual",
        "date": "2021-10-22",
        "link": "https://www.utahgeekevents.com/events/big-mountain-data-dev-2021/"
      },
      {
        "name": "Festive Tech Calendar 2021",
        "type": "Virtual",
        "date": "2021-12-30",
        "link": "https://festivetechcalendar.com/"
      },
      {
        "name": "Devnexus 2022",
        "type": "In-person",
        "date": "2022-04-12",
        "link": "https://devnexus.com/"
      },
      {
        "name": "St. Louis Java User's Group",
        "type": "Virtual",
        "date": "2022-10-13",
        "link": "https://www.meetup.com/gatewayjug/events/287572422/"
      }
    ],
    "coverImage": {
      "path": "assets/technical-debt-cover.png",
      "alt": "Initial slide of the presentation Buried in Technical Debt? Making the Right Investments in Your Code"
    },
    "eventPhotos": [
      {
        "path": "assets/technical-debt-event-atlanta-code-camp.jpeg",
        "alt": "Chris Stone speaking at Atlanta Code Camp 2021"
      },
      {
        "path": "assets/technical-debt-event-big-mountain.png",
        "alt": "Chris Stone speaking at Big Mountain Data & Dev 2021"
      }
    ],
    "abstract": "Have you ever taken a shortcut to complete a task, assuring yourself that you would go back and clean it up and do it the right way later when you had the time? In software, this is called “technical debt,” and when it piles up, it can make code hard to read and maintain. Soon enough, the cost to fix these problems can become too high, and convincing your team to take action becomes increasingly difficult. In this talk, we will discuss the different types of technical debt, how to convince other people in the organization of the importance of making regular “minimum payments,” and some creative strategies to keep in mind for software projects with excessive “accrued interest.”",
    "promoImage": {
      "path": "assets/technical-debt-promo-atlanta-code-camp.jpeg",
      "alt": "Chris Stone will be presenting at Atlanta Code Camp 2021"
    },
    "slidesLink": "https://docs.google.com/presentation/d/e/2PACX-1vSwk28blL11yjqG9skdbzMYC9ZWWgJqHcq5EjsFqp7x7rXvBwRWEJiJq4kGtqZ2IFcrFiSbs5bi3F5V/pub?start=false&loop=false&delayms=3000",
    "codeLink": "https://github.com/chrisstonedev/technical-debt",
    "codeImage": {
      "path": "assets/github-technical-debt.jpeg",
      "alt": "See the code behind this talk at github.com/chrisstonedev/technical-debt"
    },
    "recording": {
      "conference": "Festive Tech Calendar 2021",
      "thumbnail": {
        "path": "assets/technical-debt-recording-festive-tech.jpeg",
        "alt": "Buried in Technical Debt"
      },
      "link": "https://www.youtube.com/watch?v=n6-d1ZXWlz8"
    }
  },
  {
    "slug": "scully",
    "title": "Scully: The Angular Jamstack Is Out There",
    "subtitle": "Scully",
    "conferences": [
      {
        "name": "Scenic City Summit 2022",
        "type": "In-person",
        "date": "2022-07-22",
        "link": "https://sceniccitysummit.com/"
      },
      {
        "name": "Atlanta Developers' Conference 2022",
        "type": "In-person",
        "date": "2022-09-17",
        "link": "https://www.atldevcon.com/"
      },
      {
        "name": "Connect.Tech 2022",
        "type": "In-person",
        "date": "2022-11-09",
        "link": "https://2022.connect.tech/"
      }
    ],
    "coverImage": {
      "path": "assets/scully-cover.png",
      "alt": "Initial slide of the presentation The Jamstack Is Out There: Using Scully to Create Static Sites in Angular"
    },
    "eventPhotos": null,
    "abstract": "Angular is a powerful web application framework that helps us build impressive enterprise applications, but as static \"Jamstack\" sites grow in popularity, those who maintain Angular apps may feel the grass is greener with other technologies that are optimized for faster page rendering. Fortunately, the open source tool Scully is a static site generator that works with Angular to pre-render content and deliver fast and secure websites that can still connect to APIs to render dynamic content as needed. In this talk, I will demonstrate Scully by showing how it can be added to an existing Angular project, explain how it actually works behind the scenes to produce the new static assets, and recommend some good practices for incrementally improving your Angular applications.",
    "promoImage": null,
    "slidesLink": "",
    "codeLink": "",
    "codeImage": null,
    "recording": null
  },
  {
    "slug": "cypress-vs-playwright",
    "title": "Cypress Vs. Playwright: The Great Test Framework Debate",
    "subtitle": "Cypress Vs. Playwright",
    "conferences": [],
    "coverImage": null,
    "eventPhotos": null,
    "abstract": "Cypress and Playwright are two excellent popular modern frameworks for testing web applications. They are open source, frequently updated, and have dedicated communities with excellent support. But when it comes time to choose one for your project, which one should you select? Which trade-offs are better for your situation? Do you need very fast performance? Do you need to be able to test on multiple browsers? Do you need a tool that will help you write multiple levels of tests (i.e. at the component level in addition to end-to-end)?\n\nIn this talk, I will demonstrate the best features offered in the very latest version of each testing library and share a fair comparison. I will even show what it takes to set up new projects and run actual tests. And even though both have their advantages, I will share which one was a better fit for our team when we tried both hands-on, and we will poll to see which testing tool is able to win more hearts and minds.",
    "promoImage": null,
    "slidesLink": "",
    "codeLink": "",
    "codeImage": null,
    "recording": null
  },
  {
    "slug": "remote-mob-programming",
    "title": "What I Learned About Teamwork, Productivity, and Myself from Remote Mob Programming",
    "subtitle": "Remote Mob Programming",
    "conferences": [],
    "coverImage": null,
    "eventPhotos": null,
    "abstract": "",
    "promoImage": null,
    "slidesLink": "",
    "codeLink": "",
    "codeImage": null,
    "recording": null
  }
]
