[
  {
    "slug": "technical-debt",
    "title": "Buried in Technical Debt?",
    "subtitle": "Making the Right Investments in Your Code",
    "conferences": [
      {
        "name": "Atlanta Code Camp 2021",
        "type": "In-person",
        "date": "2021-10-09",
        "link": "https://atlantacodecamp.com/2021"
      },
      {
        "name": "Big Mountain Data & Dev 2021",
        "type": "Virtual",
        "date": "2021-10-22",
        "link": "https://www.utahgeekevents.com/events/big-mountain-data-dev-2021/"
      },
      {
        "name": "Festive Tech Calendar 2021",
        "type": "Virtual",
        "date": "2021-12-30",
        "link": "https://festivetechcalendar.com/"
      }
    ],
    "coverImage": {
      "path": "assets/technical-debt-cover.png",
      "alt": "Initial slide of the presentation Buried in Technical Debt? Making the Right Investments in Your Code"
    },
    "eventPhotos": [
      {
        "path": "assets/technical-debt-event-atlanta-code-camp.jpeg",
        "alt": "Chris Stone speaking at Atlanta Code Camp 2021"
      },
      {
        "path": "assets/technical-debt-event-big-mountain.png",
        "alt": "Chris Stone speaking at Big Mountain Data & Dev 2021"
      }
    ],
    "abstract": "Have you ever taken a shortcut to complete a task, assuring yourself that you would go back and clean it up and do it the right way later when you had the time? In software, this is called “technical debt,” and when it piles up, it can make code hard to read and maintain. Soon enough, the cost to fix these problems can become too high, and convincing your team to take action becomes increasingly difficult. In this talk, we will discuss the different types of technical debt, how to convince other people in the organization of the importance of making regular “minimum payments,” and some creative strategies to keep in mind for software projects with excessive “accrued interest.”",
    "promoImage": {
      "path": "assets/technical-debt-promo-atlanta-code-camp.jpeg",
      "alt": "Chris Stone will be presenting at Atlanta Code Camp 2021"
    },
    "slidesLink": "https://docs.google.com/presentation/d/e/2PACX-1vSwk28blL11yjqG9skdbzMYC9ZWWgJqHcq5EjsFqp7x7rXvBwRWEJiJq4kGtqZ2IFcrFiSbs5bi3F5V/pub?start=false&loop=false&delayms=3000",
    "codeLink": "https://github.com/chrisstonedev/technical-debt",
    "codeImage": {
      "path": "assets/github-technical-debt.jpeg",
      "alt": "See the code behind this talk at github.com/chrisstonedev/technical-debt"
    },
    "recording": {
      "conference": "Festive Tech Calendar 2021",
      "thumbnail": {
        "path": "assets/technical-debt-recording-festive-tech.jpeg",
        "alt": "Buried in Technical Debt"
      },
      "link": "https://www.youtube.com/watch?v=n6-d1ZXWlz8"
    }
  },
  {
    "slug": "scully",
    "title": "The Jamstack Is Out There",
    "subtitle": "Using Scully to Create Static Sites in Angular",
    "conferences": [],
    "coverImage": {
      "path": "assets/scully-cover.png",
      "alt": "Initial slide of the presentation The Jamstack Is Out There: Using Scully to Create Static Sites in Angular"
    },
    "eventPhotos": null,
    "abstract": "Angular is a powerful web application framework, but it can sometimes be more powerful than what we really need, creating deployment files that are very large and take significant time for users to render. When performance is a key consideration, it might be time to consider making a Jamstack static site. Scully is a static site generator that works with Angular to pre-render content and deliver fast and secure websites. In this talk, we explain what it means for a site to be a Jamstack site and how Scully works to fulfill those needs. We will cover some definitions and see the code of an Angular site as it deploys into a static site.",
    "promoImage": null,
    "slidesLink": "",
    "codeLink": "",
    "codeImage": null,
    "recording": null
  }
]
